import { sidebar } from "vuepress-theme-hope";

export default sidebar({
  "/": [
    "",
    {
      text: "如何使用",
      icon: "laptop-code",
      prefix: "demo/",
      link: "demo/",
      children: "structure",
    },
    {
      text: "文章",
      icon: "book",
      prefix: "posts/",
      children: "structure",
    },
    "intro",
    {
      text: "幻灯片",
      icon: "person-chalkboard",
      link: "https://ecosystem.vuejs.press/zh/plugins/markdown/revealjs/demo.html",
    },
  ],

  "/vue-design-patterns/": [
    {
      text: "一、前言",
      link: "preface.md",
    },
    {
      text: "二、java基础",
      collapsible: true,
      // 移除link属性，使其成为纯分组标题
      children: [
        // jvm应该指向一个具体的路径，而不是独立的侧边栏
        {
          text: "jvm",
          collapsible: true,
          // 如果jvm也是分组标题，就不要link属性；如果是页面，则添加link
          children: [
            {
              text: "类的生命周期",
              link: "basics/jvm/class-lifecycle.md",

            },
            // 可以根据需要添加更多jvm相关子菜单
          ]
        },
      ],
    },
  ],

  "/column/": [
    {

      text: "重学数据结构与算法",
      // prefix: "重学数据结构与算法/",
      collapsible: true,
      expanded: false,

      children: [
        "重学数据结构与算法/00 数据结构与算法，应该这样学！",
        "重学数据结构与算法/01 复杂度：如何衡量程序运行的效率？",
        "重学数据结构与算法/02 数据结构：将“昂贵”的时间复杂度转换成“廉价”的空间复杂度",
        "重学数据结构与算法/03 增删查：掌握数据处理的基本操作,以不变应万变",
        "重学数据结构与算法/04 如何完成线性表结构下的增删查？",
        "重学数据结构与算法/05 栈：后进先出的线性表，如何实现增删查？",
        "重学数据结构与算法/06 队列：先进先出的线性表，如何实现增删查？",
        "重学数据结构与算法/07 数组：如何实现基于索引的查找？",
        "重学数据结构与算法/08 字符串：如何正确回答面试中高频考察的字符串匹配算法？",
        "重学数据结构与算法/09 树和二叉树：分支关系与层次结构下，如何有效实现增删查？",
        "重学数据结构与算法/10 哈希表：如何利用好高效率查找的“利器”？",
        "重学数据结构与算法/11 递归：如何利用递归求解汉诺塔问题？",
        "重学数据结构与算法/12 分治：如何利用分治法完成数据查找？",
        "重学数据结构与算法/13 排序：经典排序算法原理解析与优劣对比",
        "重学数据结构与算法/14 动态规划：如何通过最优子结构，完成复杂问题求解？",
        "重学数据结构与算法/15 定位问题才能更好地解决问题：开发前的复杂度分析与技术选型",
        "重学数据结构与算法/16 真题案例（一）：算法思维训练",
        "重学数据结构与算法/17 真题案例（二）：数据结构训练",
        "重学数据结构与算法/18 真题案例（三）：力扣真题训练",
        "重学数据结构与算法/19 真题案例（四）：大厂真题实战演练",
        "重学数据结构与算法/20 代码之外，技术面试中你应该具备哪些软素质？",
        "重学数据结构与算法/21 面试中如何建立全局观，快速完成优质的手写代码？",
        "重学数据结构与算法/加餐 课后练习题详解"
      ],
    },
  ]
  ,
});
